export type Role = {
    title: ((playersCount: number) => string) | string
    picture: ((playersCount: number) => string) | string
    descriptions: ((playersCount: number) => string[]) | string[]
}

export type Roles = { [k: string]: ((playersCount: number) => Role) | Role }

export type Scenario = {
    name: string
    picture: string
    descriptions: ((playersCount: number) => string[]) | string[]
    playersCount: number[]
    mafiaRoles?: ((playersCount: number) => Roles | undefined) | Roles
    citizenRoles?: ((playersCount: number) => Roles | undefined) | Roles
    independentRoles?: ((playersCount: number) => Roles | undefined) | Roles
    notes?: ((playersCount: number) => string[]) | string[]
    actsOrder?: ((playersCount: number) => string[]) | string[]
}

export const scenarios: Scenario[] = [
    {
        name: "آهنگر",
        picture: "Ahangar_main",
        descriptions: [
            "Lorem ipsum dolor sit amet consectetur adipisicing elit. Illum ipsum provident eligendi odio officia ipsam assumenda aperiam ipsa, a inventore cupiditate sed ex earum mollitia dolorum iusto incidunt nihil laudantium. Fugiat commodi vel praesentium culpa distinctio cum, dolorum dicta id in sint minima omnis quod esse iste, quisquam consectetur ducimus.",
            "Lorem ipsum dolor sit amet consectetur adipisicing elit. Illum ipsum provident eligendi odio officia ipsam assumenda aperiam ipsa, a inventore cupiditate sed ex earum mollitia dolorum iusto incidunt nihil laudantium. Fugiat commodi vel praesentium culpa distinctio cum, dolorum dicta id in sint minima omnis quod esse iste, quisquam consectetur ducimus."
        ],
        playersCount: [8],
        mafiaRoles: {
            "گادفادر": {
                title: "گادفادر",
                picture: "GodFather",
                descriptions: [
                    "وظیفه هدایت و رهبری گروه مافیا و شلیک شب را برعهده دارد و همچنین تائید انتخاب و کلمه گذاری لیدی بر عهده رئیس مافیاست."
                ]
            },
            "لیدی": {
                title: "لیدی",
                picture: "Lady",
                descriptions: [
                    "انتخاب کلمه و گذاشتن آن بر روی یکی از شهروندان با تائید رئیس مافیا را به عهده دارد.",
                    "شهروند انتخاب شده توسط لیدی، بعد از گفتن کلمه، مستقیما وصیت می کند و از روند بازی خارج می شود."
                ]
            },
        },
        citizenRoles: {
            "دکتر": {
                title: "دکتر",
                picture: "Doctor",
                descriptions: [
                    "آهنگر یا زره سازمی تواند یک زره روز را به بازیکنان داخل بازی بدهد.",
                    "او هر شب یک زره را بر تن یکی از بازیکنان بازی می کند تا در برابر کلمه لیدی و خروج از رای گیری از آن بازیکن محافظت کند.",
                    "آهنگر در طول بازی، دو بار می تواند به خودش زره بدهد اما دو شب پشت سرهم نمی تواند به خودش زره بدهد.\nآهنگر دو شب پشت سرهم نمی تواند به یک شخص زره بدهد."
                ]
            },
            "آهنگر": {
                title: "آهنگر",
                picture: "Ahangar",
                descriptions: [
                    "هر شب می تواند فرد یا افرادی رو انتخاب کند و آن ها را در بازی از شات ( شلیک شب ) گروه مافیا نجات بدهد.",
                    "دکتر در این بازی در تعداد هشت نفر، دو حق انتخاب نجات ( سیو ) و هفت نفر به پایین یک حق انتخاب دارد.",
                    "دکتر خودش را در طول بازی می تواند دو بار نجات بدهد و حتی می تواد دو شب پشت سرهم هم خودش را نجات بدهد."
                ]
            },
            "شهر ساده": {
                title: "شهروند ساده",
                picture: "Citizen",
                descriptions: [
                    "در شب توانایی خاصی ندارد و در روز باید با دقت به فکت ها و استدلال های بازی توجه کند و به همشهری های خود کمک کند تا مافیاها را از بازی خارج کنند. امکان سوداگری با شهروند ساده وجود دارد."
                ]
            }
        },
        notes: [],
        actsOrder: ["تیم مافیا", "دکتر", "آهنگر"]
    },
    {
        name: "بازپرس",
        picture: "Bazpors_main",
        descriptions: [
            "یکی از محبوب ترین سناریوهای بازی مافیا در ایران است که در بازی شهروند و مافیای تلویزیون برای اولین بار پخش شد و با استقبال زیادی توسط علاقمندان به بازی مافیا روبرو شد و خیلی سریع به یکی از چند سناریوی محبوب 10 نفره تبدیل شد و این امکان را هم دارد که در تعداد 12، 13 و 15 نفره هم بازی شود.",
            "در این سناریو، تحلیل، استدلال و منطق حرف اول را می زند  و همین امر باعث می شود که یکی از پرهیجان ترین و پرچالش ترین بازی های مافیا را تجربه کنید.",
            "همانطور که از اسمش هم مشخص است یک نقش مرکزی در بازی وجود دارد به اسم بازپرس. بازپرس یک نقش بسیار مهم و استراتژیک در گروه شهروند است که می تواند سرنوشت بازی را تعیین کند و گروه شهروند را به سمت پیروزی یا شکست هدایت کند. بازپرس، نماد عدالت در بازی است و باید با دقت روند بازی را زیر نظر بگیرد و به نکات ریز و جزئیات بازی توجه کند تا مشکوک ترین افراد را به بازپرسی فرا خواند تا بعد از دفاع کردن از خودشان، شخص بازپرس و بعد از آن اعضای شهر درباره آن ها تصمیم گیری کنند و رای به خروج یکی از آن ها بدهند تا بعد از خروج مشخص شود که فرد مشکوک، عضو گروه مافیا بوده است یا نه.",
            "",
        ],
        playersCount: [10, 12, 13, 15],
        mafiaRoles: (count) => {
            const mafia: Roles = {
                "گادفادر": {
                    title: "گادفادر",
                    picture: "GodFather",
                    descriptions: [
                        "وظیفه هدایت و رهبری گروه مافیا و شلیک شب را برعهده دارد و همچنین تائید ناتویی گروه مافیا با رئیس مافیاست.",
                        "استعلامش برای کارآگاه منفی است و محقق هم نمی تواند با خودش رئیس مافیا را از بازی خارج کند.",
                        "قابلیت سوداگری ( یاکوزایی ):می تواند یکی از یارانش را فدا کند و با شهروند ساده یا روئین تن مذاکره بزند و اگر مذاکره درست باشد، آن شهروند از همان شب با گروه مافیا بیدار می شود و صبح روز بعد مافیای فدا شده از بازی خارج می شود."
                    ]
                },
                "ناتو": {
                    title: "ناتو",
                    picture: "Nato",
                    descriptions: [
                        "یک بار در طول بازی می تواند از توانایی اش به جای شات ( شلیک ) شب استفاده کند به این صورت که می تواند نقش یک شهروند نقش دار را حدس بزند و اگر حدسش درست باشد، صبح روز بعد آن شهروند قطعا از روند بازی خارج می شود و اگر حدسش اشتباه باشد، هیچ اتفاقی نمی افتد.",
                    ]
                },
                "شیاد": {
                    title: "شیاد",
                    picture: "Shaiad",
                    descriptions: [
                        "با گروه مافیا بیدار می شود اما به تنهایی توانایی اش را استفاده می کند. وظیفه اصلی شیاد پیدا کردن کارآگاه است و اگر کارآگاه را درست تشخیص بدهد، استعلام کارآگاه در آن شب منفی خواهد بود.",
                    ]
                },
            }

            if (count >= 12)
                mafia["ساده"] = {
                    title: "ساده",
                    picture: "Mafia",
                    descriptions: (count) => ([
                        count === 15 ? "2 نفر" : "یک نفر",
                        "در شب توانایی خاصی ندارد و به رئیس مافیا برای شلیک شب مشورت می دهد و در روز تلاش می کند اتهام ها را از روی یارانش بر دارد و شهروندان را از بازی خارج کند."
                    ])
                }

            return mafia
        },
        citizenRoles: (count) => {
            const citizens: Roles = {
                "محقق": {
                    title: "محقق",
                    picture: "Researcher",
                    descriptions: [
                        "هر شب، به جز شب معارفه قبل از گروه مافیا بیدار می شود و یک نفر را انتخاب می کند و خودش را به آن شخص گره ( پیوند ) می زند. اگر در همان شب یا در روز با رای گیری محقق از روند بازی خارج شود، اگر فرد انتخاب شده مافیا باشد ( ناتو یا شیاد )، همراه محقق از بازی خارج می شود."
                    ]
                },
                "کارآگاه": {
                    title: "کارآگاه",
                    picture: "Investigator",
                    descriptions: [
                        "هر شب یک نفر را انتخاب می کند و استعلامش را از گرداننده بازی می گیرد تا بفهمد آن فرد مافیا هست یا نه. استعلام رئیس مافیا  برایش منفی است."
                    ]
                },
                "بازپرس": {
                    title: "بازپرس",
                    picture: "Interrogator",
                    descriptions: [
                        "مهم ترین و تاثیر گذارترین شهروند در این بازی است که یک بار در طول بازی می تواند از توانایی خودش استفاده کند. در یکی از شب ها دو نفر را انتخاب می کند که در ابتدای روز بعد و قبل از شروع شدن صحبت افراد، در دفاعیه ( بازپرسی ) حضور پیدا کنند و در دو نوبت سی ثانیه ای از خودشان دفاع کنند و بعد از آن خواب نیم روزی خواهند داشت که در آن خواب بازپرس بیدار می شود و بر ادامه بازپرسی یا لغو ( ملقا ) آن اقدام می کند. اگر بازپرسی لغو شد، اتفاقی نمی افتد و از اول دوباره همه به ترتیب صحبت می کنند اما اگر بازپرسی ادامه پیدا کرد، به اجبار همه باید به یکی از آن دو نفر رای بدهند تا یکی از آن ها از روند بازی خارج شود. فرد خارج شده در بازپرسی وصیت می کند و بعد از آن، ساید ( شهروند یا مافیا بودن ) آن فرد خوانده می شود.",
                        "اگر رای گیری بازپرسی برابر شود، هیچ اتفاقی نمی افتد و هر دو در بازی باقی می مانند."
                    ]
                },
                "دکتر": {
                    title: "دکتر",
                    picture: "Doctor",
                    descriptions: [
                        "آهنگر یا زره سازمی تواند یک زره روز را به بازیکنان داخل بازی وظیفه نجات دادن شهروندان در مقابل شات ( شلیک ) شب گروه مافیا را بر عهده دارد. دکتر هر شب می تواند یک نفر را نجات دهد. دکتر در طول بازی خودش را می تواند دو بار نجات دهد."
                    ]
                },
                "رویین تن": {
                    title: "رویین تن",
                    picture: "Immortal",
                    descriptions: [
                        "یکی از شهروندان است که توانایی خاصی ندارد که هر شب بخواهد اجرا کند. او زره شب دارد و در شب ها نامیرا است. امکان سوداگری با روئین تن وجود دارد."
                    ]
                },
                "شهر ساده": {
                    title: "شهروند ساده",
                    picture: "Citizen",
                    descriptions: (count) => ([
                        count === 10 ? " 2 نفر" : (count === 12 ? "2 نفر" : (count === 13 ? "3 نفر" : (count === 15 ? "3 نفر" : "Error!"))),
                        "در شب توانایی خاصی ندارد و در روز باید با دقت به فکت ها و استدلال های بازی توجه کند و به همشهری های خود کمک کند تا مافیاها را از بازی خارج کنند. امکان سوداگری با شهروند ساده وجود دارد."
                    ])
                }
            }

            if (count >= 12)
                citizens["اسنایپر"] = {
                    title: "اسنایپر",
                    picture: "Snipper",
                    descriptions: [
                        "در بازی فقط یک بار می تواند از توانایی خودش استفاده کند به این صورت که در یکی از شب ها یک نفر را انتخاب می کند و به آن شلیک می کند، اگر آن فرد مافیا باشد از بازی خارج می شود و اگر آن فرد شهروند باشد، تک تیر انداز خودش از بازی خارج می شود.",
                        "شلیک تک تیر انداز به رئیس مافیا اثر ندارد و هیچ کدام از بازی خارج نمی شوند."
                    ]
                }

            return citizens
        },
        notes: [
            "اگر سوداگری ناموفق باشد، صبح روز بعد فقط مافیای فدا شده به تنهایی از روند بازی خارج می شود و هیچ کس به گروه مافیا اضافه نمی شود.",
            "تا زمانی که یاران رئیس مافیا در بازی هستند، او نمی تواند خودش را سوداگری کند و فقط زمانی که به عنوان تنها مافیای بازی باشد این امکان برای او وجود خواهد داشت.",
            "ناتویی باید با تائید رئیس مافیا باشد و اگر ناتویی انجام شد، دیگر از هیچ کدام از توانایی های گروه مافیا ( شات یا سوداگری ) نمی توانند استفاده کنند.",
            "ناتویی باعث دیفیوز ( عدم توانایی ) شدن آن شهروند نقش دار نمی شود و آن شهروند قبل از خروجش می تواند از توانایی خود استفاده کند.",
            "گروه مافیا حق مسیر دادن به شیاد را ندارد.",
            "شیاد می تواند هر شب یک نفر خاص را انتخاب کند و محدودیتی ندارد.",
            "توانایی محقق بر روی رئیس مافیا اثر ندارد ورئیس مافیا همراه محقق خارج نمی شود. ",
            "اگر بازپرس در شب از بازی خارج شود، در روز بازپرسی انجام می شود و امکان لغو بازپرسی وجود نخواهد داشت.",
            "اگر یکی از افراد حاضر در بازپرسی در شب از بازی خارج شود، روز بعد بازپرسی انجام نمی شود و توانایی بازپرس به او بر می گردد تا در شب های بعدی از آن استفاده کند.",
            "در شبی که ناتویی انجام می شود، دکتر بیدار نمی شود.",
            "",
            "",
            "",
            "",
            "",
            "در تعداد 12 نفره، اسنایپر ( تک تیرانداز ) به گروه شهروند و مافیای ساده به گروه مافیا اضافه می شود.",
            "در تعداد 13 نفره، یک شهروند ساده اضافه می شود.",
            "در تعداد 13 نفره، امکان سوداگری با روئین تن وجود ندارد.",
            "در تعداد 15 نفر، یک شهروند ساده و یک مافیای ساده اضافه می شود."
        ],
        actsOrder: (count) => {
            const order = ["محقق", "تیم مافیا", "شیاد", "کاراگاه", "دکتر", "بازپرس"]

            if (count >= 12)
                order.push("اسنایپر")

            return order
        }
    }
]
